; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing )
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        
      )
  )

)

; problem
(define (problem transport-81)
 (:domain transport)
 (:objects 
    v1 v2 v3 v4 v5 v6 - vehicle
    p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 - package
    l1 l2 l3 l4 l5 l6 l7 l8 l9 l10 l11 l12 l13 l14 - location
    c0 c1 c2 - size
    )
 (:init (capacity v1 c1)
    (capacity v2 c2)
    (capacity v3 c1)
    (capacity v4 c2)
    (capacity v5 c1)
    (capacity v6 c2)
    (capacity-predecessor c0 c1)
    (capacity-predecessor c1 c2)
    (at p1 l14)
    (at p2 l11)
    (at p3 l12)
    (at p4 l10)
    (at p5 l3)
    (at p6 l2)
    (at p7 l5)
    (at p8 l8)
    (at p9 l12)
    (at p10 l4)
    (at p11 l9)
    (at p12 l7)
    (at p13 l7)
    (at p14 l12)
    (at v1 l11)
    (at v2 l3)
    (at v3 l13)
    (at v4 l6)
    (at v5 l5)
    (at v6 l13)
    (road l3 l4)
    (road l4 l3)
    (road l3 l1)
    (road l14 l7)
    (road l3 l10)
    (road l5 l1)
    (road l14 l10)
    (road l9 l5)
    (road l10 l3)
    (road l8 l12)
    (road l1 l3)
    (road l12 l3)
    (road l3 l6)
    (road l3 l12)
    (road l5 l9)
    (road l4 l11)
    (road l11 l4)
    (road l1 l5)
    (road l10 l14)
    (road l6 l13)
    (road l3 l2)
    (road l12 l8)
    (road l2 l3)
    (road l13 l6)
    (road l6 l3)
    (road l7 l14)
    (road l1 l8)
    (road l8 l1)
    )
 (:goal (and 
(at p1 l13)
(at p2 l6)
(at p3 l14)
(at p4 l11)
(at p5 l2)
(at p6 l5)
(at p7 l9)
))
)

; plan
1. (pick-up v5 l5 p7 c0 c1)
   deleted: (at p7 l5) (capacity v5 c1)
   added: (in p7 v5) (capacity v5 c0)
   goals met: 0 of 7
2. (drive v5 l5 l9)
   deleted: (at v5 l5)
   added: (at v5 l9)
   goals met: 0 of 7
3. (drop v5 l9 p7 c0 c1)
   deleted: (in p7 v5) (capacity v5 c0)
   added: (at p7 l9) (capacity v5 c1)
   goals met: 1 of 7
4. (drive v2 l3 l12)
   deleted: (at v2 l3)
   added: (at v2 l12)
   goals met: 1 of 7
5. (pick-up v2 l12 p3 c1 c2)
   deleted: (at p3 l12) (capacity v2 c2)
   added: (in p3 v2) (capacity v2 c1)
   goals met: 1 of 7
6. (drive v2 l12 l3)
   deleted: (at v2 l12)
   added: (at v2 l3)
   goals met: 1 of 7
7. (drive v2 l3 l10)
   deleted: (at v2 l3)
   added: (at v2 l10)
   goals met: 1 of 7
8. (drive v2 l10 l14)
   deleted: (at v2 l10)
   added: (at v2 l14)
   goals met: 1 of 7
9. (pick-up v2 l14 p1 c0 c1)
   deleted: (at p1 l14) (capacity v2 c1)
   added: (in p1 v2) (capacity v2 c0)
   goals met: 1 of 7
10. (drop v2 l14 p3 c0 c1)
   deleted: (in p3 v2) (capacity v2 c0)
   added: (at p3 l14) (capacity v2 c1)
   goals met: 2 of 7
11. (drive v2 l14 l10)
   deleted: (at v2 l14)
   added: (at v2 l10)
   goals met: 2 of 7
12. (pick-up v2 l10 p4 c0 c1)
   deleted: (at p4 l10) (capacity v2 c1)
   added: (in p4 v2) (capacity v2 c0)
   goals met: 2 of 7
13. (drive v2 l10 l3)
   deleted: (at v2 l10)
   added: (at v2 l3)
   goals met: 2 of 7
14. (drive v2 l3 l4)
   deleted: (at v2 l3)
   added: (at v2 l4)
   goals met: 2 of 7
15. (drive v2 l4 l11)
   deleted: (at v2 l4)
   added: (at v2 l11)
   goals met: 2 of 7
16. (drop v2 l11 p4 c0 c1)
   deleted: (in p4 v2) (capacity v2 c0)
   added: (at p4 l11) (capacity v2 c1)
   goals met: 3 of 7
17. (pick-up v2 l11 p2 c0 c1)
   deleted: (at p2 l11) (capacity v2 c1)
   added: (in p2 v2) (capacity v2 c0)
   goals met: 3 of 7
18. (drive v2 l11 l4)
   deleted: (at v2 l11)
   added: (at v2 l4)
   goals met: 3 of 7
19. (drive v2 l4 l3)
   deleted: (at v2 l4)
   added: (at v2 l3)
   goals met: 3 of 7
20. (drive v2 l3 l6)
   deleted: (at v2 l3)
   added: (at v2 l6)
   goals met: 3 of 7
21. (drop v2 l6 p2 c0 c1)
   deleted: (in p2 v2) (capacity v2 c0)
   added: (at p2 l6) (capacity v2 c1)
   goals met: 4 of 7
22. (drive v2 l6 l13)
   deleted: (at v2 l6)
   added: (at v2 l13)
   goals met: 4 of 7
23. (drop v2 l13 p1 c1 c2)
   deleted: (in p1 v2) (capacity v2 c1)
   added: (at p1 l13) (capacity v2 c2)
   goals met: 5 of 7
24. (drive v4 l6 l3)
   deleted: (at v4 l6)
   added: (at v4 l3)
   goals met: 5 of 7
25. (pick-up v4 l3 p5 c1 c2)
   deleted: (at p5 l3) (capacity v4 c2)
   added: (in p5 v4) (capacity v4 c1)
   goals met: 5 of 7
26. (drive v4 l3 l2)
   deleted: (at v4 l3)
   added: (at v4 l2)
   goals met: 5 of 7
27. (drop v4 l2 p5 c1 c2)
   deleted: (in p5 v4) (capacity v4 c1)
   added: (at p5 l2) (capacity v4 c2)
   goals met: 6 of 7
28. (pick-up v4 l2 p6 c1 c2)
   deleted: (at p6 l2) (capacity v4 c2)
   added: (in p6 v4) (capacity v4 c1)
   goals met: 6 of 7
29. (drive v4 l2 l3)
   deleted: (at v4 l2)
   added: (at v4 l3)
   goals met: 6 of 7
30. (drive v4 l3 l1)
   deleted: (at v4 l3)
   added: (at v4 l1)
   goals met: 6 of 7
31. (drive v4 l1 l5)
   deleted: (at v4 l1)
   added: (at v4 l5)
   goals met: 6 of 7
32. (drop v4 l5 p6 c1 c2)
   deleted: (in p6 v4) (capacity v4 c1)
   added: (at p6 l5) (capacity v4 c2)
   goals met: 7 of 7
